'number' + 3 + 3 // оскільки ми пишемо + після стрінгу, то в нас відбувається операція конкатанації, тому ми отримаємо просто стрінгу Відповідь: 'number33'

null + 3 // Відповідь: 3, оскільки null це нічого, а 3 це просто число

5 && "qwerty" // Відповідь 'qwerty', оскільки береться останнє значення

+'40' + +'2' + "hillel"; // Відповідь: '42hillel', оскільки унарний плюс перед стрінгами переведе їх в числа, вони додадуться, а потім до цього додастся стрінга і все значення стане стрінгою

'10' - 5 === 6; // Відповідь: false, оскільки від 10 відніметься 5, а 5 не дорівнює 6

true + false  //true = 1, false = 0, тому Відповідь: 1

'4px' - 3 // Відповідь: NaN, оскільки ми намагаємось відняти від стрінги інтове значення

'4' - 3 //  Відповідь: 1, оскільки 4 неявно перейде в інт і від 4 відніметься 3

'6' + 3 ** 0; // Відповідь: '61' string, оскільки спочатку відбудеться піднесення 3 в степінь 0, а потім відбудеться конкатанація і 1 додастся до 6 в стрінг

12 / '6' // Відповідь: 2, оскільки стрінгове 6 неявно перейде в інт і 12 поділиться на 6

'10' + (5 === 6); // Відповідь: '10false', оскільки 5 не дорівнює 6 і це дасть false і потім за допомогою конкатанації до стрінги 10 додастся стрінга false

null == '' // тут буде відбуватись порівняння false стейтмента з порожньою стрінгою, яка теж є false тому Відповідь: true

3 ** (9 / 3); // це операція піднесення до степеню, тому тут буде 3 в 3й степені, тому тут буде Відповідь: 27

!!'false' == !!'true' //  Відповідь

0 || '0' && 1 // Відповідь: 1, оскільки просто по останньому оператору && покаже праве значення

(+null == false) < 1; // Відповідь; true, оскільки +null буде 0, a 0 дорівнює false, при порівнянні false < 1, false буде 0, а 0<1

false && true || true // Відповідь: true, оскільки в парі false && true обереться перший ложний аргумент, і потім при порівнянні false || true, по табличці покаже true відповідно до таблиці

false && (false || true); // Відповідь: false, оскільки за табличкою порівняння false || true буде true, а потім при порівнянні false && true покаже перший ложний аргумент, тому буде false

(+null == false) < 1 ** 5; // Відповідь: false, оскільки 0 == false буде true, a true = 0, піднесення 1 до 5 степені буде 1, а 1 не менше 1